<template>
  <section id="commonProblem-wrapper">
    <div class="mainTit">{{ common.mainTit }}</div>
    <div class="item" v-for="item,index in common.itemList" :key="index">
      <p class="q"><span>Q：</span>{{ item.q }}</p>
      <p class="a"><span>A：</span>{{ item.a }}</p>
    </div>
  </section>
</template>

<script>
  export default {
    name: 'commonProblem',
    data(){
      return {
        common: {
          mainTit: '常见问题',
          itemList: [
            {
              q: '怎样成为会员？',
              a: '累积充值金额的达到XX或者一次性充值XX，账号自动升级为永久会员。'
            },
            {
              q: '什么是金币？',
              a: '实际充值现金，系统自动发放金币到账户，任务渲染系统扣除金币。'
            },
            {
              q: '资产中“剩余有效期（天）”含义？',
              a: '表示当前资产文件在服务器上剩余存储天数，到期我们会删掉文件，如有特殊需求，请及时联系客服。'
            },
            {
              q: '为什么有的任务曾经可以看到渲染图片现在看不到了？',
              a: '渲染出图平台会自动保存20天，20天后会自动清除，请及时下载。'
            },
            {
              q: '账号欠费，但目前还存在任务在渲染中，会自动暂停渲染吗？',
              a: '会的，欠费会自动停止渲染任务。'
            },
            {
              q: '账号欠费，已经渲染完成的图片是否允许下载？',
              a: '不允许下载，需要将欠费补齐后才可以下载。'
            },
            {
              q: '渲染时长是怎么统计的？',
              a: '渲染所需的时间有场景文件的复杂程度决定的。渲染时长是根据场景文件在云端开始渲染到完成渲染的时间进行统计的，如果当前帧重复渲染完成多次，渲染时长会进行累计。'
            },
            {
              q: '渲染费用是怎样计算的？',
              a: 'CPU渲染费用=核小时单价 x 模式线程数 x 渲染时长（小时）； GPU渲染费用=机时单价 x 模式节点机个数 x 渲染时长（小时）'
            },
            {
              q: '任务正在渲染中可以关机吗？',
              a: '可以。渲染中的认为关闭浏览器或者关机都不会影响在云端的渲染。'
            },
            {
              q: '模型文件不大，但是上传或下载需要很长时间是什么原因？',
              a: '上传或下载速度慢一般是因为本地网络不太稳定导致，请您首先检查下本机是否有其他战友太多网络带宽的应用，在进行上传或下载前请尽量关闭。'
            }

          ]
        },
      }
    }
  }
</script>

<style lang="less" scoped>

</style>
