<template>
  <div class="protocal-wrapper">
    <div class="mainTit">{{ tit }}</div>
    <section>
      <div class="item" v-for="item,index in protocal" :key="index">
        <div class="miniTit">{{ item.tit }}</div>
        <div class="miniItem" v-for="miniItem,ind in item.list" :key="ind">
          <p>{{ miniItem.li }}</p>
          <p v-for="min,i in miniItem.list" :key="i" v-if="miniItem.list">{{ min }}</p>
        </div>
      </div>
    </section>
  </div>
</template>

<script>
  export default {
    name: 'protocal',
    data(){
      return {
        tit: '中国电影云用户服务协议',
        protocal: [
          {
            tit: '一、总则',
            list: [
              { li: `1.用户将基于以下条款和条件，获得中国电影云平台提供的各项服务。用户在使用中国电影云平台之前，请务必认真阅读和理解本《中国电影云用户服务协议》（以下简称“协议”）中规定的包括免责条款的所有权利和限制。` },
              { li: `2.请您审慎阅读并选择接受或不接受本协议，本协议具有合同上的法律效力。同意遵守本协议及所有规则后方可成为中国电影云平台用户，一旦用户注册成功，则用户与中国电影云平台之间自动形成协议关系，用户应当受本协议及所有规则的约束。` },
              { li: `3.本协议由中国电影云平台定期更新，用户在使用中国电影云平台时应该及时关注，最终解释权归中国电影云平台所有。` },
              { li: `4.本协议适用中国法律，自用户愿意接受中国电影云平台提供服务并注册账户时生效，签订地为中国山东省青岛市。` }
            ]
          },
          {
            tit: '二、产品服务及技术、安全保障',
            list: [
              { li: `1.中国电影云平台是中宣部中国电影科学技术研究所发起的国内第一个全流程的影视制作和管理平台，平台的开发、运营经验数据将为制定中国的影视后期制作技术标准的提供有力支持。青岛已臻化境影视科技有限公司为中国电影云平台全球唯一授权开发、运营单位。` },
              { li: `2.现阶段服务内容包括：云渲染农场。`,
                list: [
                 `2.1 云渲染农场：集群渲染服务，对复杂渲染任务实施分解和并行加速；实时渲染服务，将渲染效果极速呈现；渲染咨询服务，提供在线渲染咨询。`,
                 `2.2 中国电影云平台保留随时变更、中止或终止部分或全部服务的权利。`
                ]
              },
              { li: `3.服务时段`,
                list: [
                  `3.1 中国电影云平台 24 小时运营。`,
                  `3.2 法定节假日（如中国的春节）服务时段如有调整会在官网公布。`
                ]
              },
              { li: `4.云渲染农场` },
              { list: [
                     `4.1 技术护航`,
                     `4.1.1 云渲染农场采用高性能的硬件配置，网络技术基础设施安全稳定。`,
                     `4.1.2 中国电影云平台拥有业内优秀的专业团队和电影科学技术研究所的专业技术支持，能够迅速地帮助您解决渲染过程中的技术难题。`,
                     `4.1.3 如属渲染效果不正确或效率慢等问题，在线客服预判断问题后会进行简单故障排除引导处理，无法解决的情况下会升级问题到我司技术部门。`,
                     `4.1.4 技术部门处理问题花费的时间会根据难易程度而定，请用户耐心等待该问题处理结果，并保持与在线客服沟通。`,
                ]
              },
              { li: `4.2 资源优势` },
              { list: [
                     `4.2.1 中国电影云平台拥有的云计算能力中包括自有的服务器平台，以及我们战略合作方的计算资源。如果用户有特殊的渲染配置需求，例如需要特定型号的内存、CPU 或 GPU 等，我们可以根据您的需求定制化提供同等的计算能力。`,
                     `4.2.2 在渲染过程中，如果遇到产能需求不足的情况请及时联系您的商务经理协调。也可联系在线客服引导将任务提交到资源较为充足的服务平台。`,
                     `4.3.数据安全`,
                     `4.3.1 用户注册完成之后，上传到平台的素材文件会在 20 天后自动清除。`,
                     `4.3.2 用户渲染完成后，请及时下载输出文件，平台会自动保留输出文件 20 天，20 天后会自动清除。若用户因为未及时下载文件而需要再次提交渲染而产生的渲染费用，将由用户自行承担。`,
                     `4.3.3 针对渲染周期较长的项目，如需要特殊保留原文件与素材，请提前在商务洽谈阶段提出文件保留时间明确需求，否则系统按前述规则自行清理。`
                ]
              },
              {li: `5.中国电影云平台拥有完善的安全体系，文件分发加密解密，保障数据安全。`},
              {li: `6.中国电影云平台仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如电脑、调制解调器及其他与接入互联网有关的装置)及其所需的费用(如为接入互联网而支付的电话费及上网费)均应由用户自行负担。`}
            ]
          },
          {
            tit: '三、用户信息及账户安全',
            list: [
              { li: `1.中国电影云平台用户可为须接受本协议，且能够独立承担民事责任的的自然人和法人。` },
              { li: `2.用户须在使用中国电影云平台服务前，以其真实身份注册账户，并依中国电影云平台提示提供真实、准确、有效及完整的资料，并对所提供的信息负责。` },
              { li: `3.用户应遵守法律、法规的相关规定及中国电影云平台发布及更新的全部规则，不得上传含有下列内容的场景文件，贴图等，同时渲染产品不能包含下列内容：` },
              { li: `3.1 反对宪法所确定的基本原则的。` },
              { li: `3.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的。` },
              { li: `3.3 损害国家荣誉和利益的。` },
              { li: `3.4 煽动民族仇恨、民族歧视，破坏民族团结的。` },
              { li: `3.5 破坏国家宗教政策，宣扬邪教和封建迷信的。` },
              { li: `3.6 散布谣言，扰乱社会秩序，破坏社会稳定的。` },
              { li: `3.7 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的。` },
              { li: `3.8 侮辱或者诽谤他人，侵害他人合法权益的。` },
              { li: `3.9 违反法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的。` },
              { li: `3.10 相关法律法规或本协议、相关协议、规则等禁止的。` },
              { li: `4.用户须注意保管好自己的账号密码，不要将用户名密码泄露给任何他人使用。使用完毕后应安全退出，如果用户因为没有保管好账号和密码导致遭受被盗号或密码失窃而遭受损失的，中国电影云不承担任何责任。` },
              { li: `5.用户应使用正版软件接受服务。` }
            ]
          },
          {
            tit: '四、隐私保护',
            list: [
              { li: `1.隐私资料是指中国电影云平台在提供服务时收集、储存和使用的个人信息和用户上传的资料。` },
              { li: `2.在不透露单个用户隐私资料的前提下，中国电影云平台有权对整个用户数据库进行技术分析。` },
              { li: `3.未经用户许可中国电影云平台不会向任何第三方公开或共享用户注册资料中的姓名、个人有效身份证件号码、联系方式、家庭住址等个人身份信息，但下列情况除外：` },
              { li: `3.1 用户或用户监护人授权我方披露的；` },
              { li: `3.2 有关法令要求我方披露的；` },
              { li: `3.3 司法机关或行政机关基于法定程序要求我方提供的；` },
              { li: `3.4 我方为了维护自己合法权益而向用户提起诉讼或者仲裁时；` },
              { li: `3.5 应用户监护人的合法要求而提供用户个人身份信息时；` },
              { li: `3.6 为维护社会公众的利益。` },
              { li: `4.中国电影云平台已建立专门的技术团队负责建立符合数据安全技术标准的系统与程序，并结合访问权限控制、安全事件处置等多重措施努力保护用户的隐私资料不被未经授权的访问获取、使用或泄露。` }
            ]
          },
          {
            tit: '五、收费及充值',
            list: [
              { li: `1.中国电影云平台部分服务为收费服务，用户选择使用该服务时，中国电影云平台将收取一定费用，如渲染完成的渲染费用和超过免费次数的下载费用。中国电影云平台会根据实际情况向用户赠送一定数量的免费体验次数或渲染农场金币。` },
              { li: `2.充值记录、消费情况会在消费记录中显示，用户可随时查看。` },
              { li: `3.在中国电影云平台渲染农场系统中，用户账户充值时，应使用中国电影云平台指定的方式（支付宝支付、微信支付）向用户账户充入资金，其账号直接获得渲染农场金币，渲染农场金币可以用于支付所有渲染农场系统中产生的费用。充值后用户在系统已发生金币使用的，无论使用量大小，不予退费。` },
              { li: `4.中国电影云平台只能按照实际充值金额向用户开具收据或发票，赠送金币数不可以开具收据或发票。` },
              { li: `5.中国电影云平台不提供用户间交易金币的平台化服务。用户间交易金币系构成对本协议的违反，中国电影云有权在未经通知的情况下，采取相应适当措施。` }
            ]
          },
          {
            tit: '六、权利声明',
            list: [
              { li: `1.中国电影云平台提供的网络服务内容包括：文字、软件、声音、图片、录象、图表等。所有这些内容受著作权法、商标法和其它法律法规的保护。` },
              { li: `2.用户只有在获得中国电影云平台或其他相关权利人的书面授权之后才能使用这些内容，不能擅自复制、再造这些内容、或创造与内容有关的派生产品。` },
              { li: `3.中国电影云平台暂未行使本条款或按照法律规定所享有的权利，不应被视为放弃该权利，也不影响将来行使该权利。在法律允许的最大范围内，青岛已臻化境影视科技有限公司保留对本用户协议条款的最终解释权。` },
              { li: `4.对于采用非法手段获取，转载或利用中国电影云平台上的资料或用户信息的，青岛已臻化境影视科技有限公司保留追究其法律责任的权利；若触犯刑法也有权利和义务向相关部门报案。` }
            ]
          },
          {
            tit: '七、免责声明',
            list: [
              { li: `1.中国电影云平台仅提供计算服务，不提供数据保管服务，因此请用户在规定时间内下载。超期下载云端自动删除数据的，中国电影云平台并不对此负责，且不会退还费用。` },
              { li: `2.在使用中国电影云平台服务过程中，用户本地数据，请用户自己保管并做好备份。用户在客户端分析文件时选择性上传部分日志至平台的，中国电影云平台承诺分析日志仅在内部被查看以帮助用户解决问题，不做其他用途。在使用服务过程中产生任何可能对用户系统造成的损坏或者数据的损坏，中国电影云平台不承担责任。` },
              { li: `3.由于不可抗力或者政府以及法律要求，产生的对用户数据的任何损坏或者泄露，中国电影云平台不承担任何责任。` }
            ]
          }
        ],
      }
    }
  }
</script>

<style lang="less" scoped>
  section {
    margin-bottom: 20px;
    .item {
      line-height: 2.2em;
      .miniTit {
        font-weight: 600;
        line-height: 3.2em;
      }
      .miniItem {
        text-indent: 2.0em;
      }
    }
  }
</style>
